app/views/questions/index.html.erb

  Votes: <%= question.votes.count %> |
  Answers: <%= question.answers.count %>
---
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 3]]