app/views/questions/show.html.erb


<% if @question.answers.count > 0 %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 4]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 2]]