app/views/users/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = $1  [["user_id", 4]]
---
<div class="user-page-questions">
<% if @user.questions.count > 0 %>

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]
---
    Votes: | <%= question.votes.count %>
    Answers: | <%= question.answers.count %>