app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
---
  def new
    @answer = Answer.new
    @question = Question.find(params[:question_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "answers" ("content", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "adsfasdfadsf"], ["user_id", 5], ["question_id", 4], ["created_at", "2015-04-15 15:01:33.713453"], ["updated_at", "2015-04-15 15:01:33.713453"]]
UPDATE "answers" SET "accepted" = 'f' WHERE "answers"."question_id" = $1  [["question_id", 4]]
---
  def create
    render_page
    start_time = Time.now
    @answer = Answer.new(answer_params)
    @answer.user = User.find(current_user.id)
    @answer.question = Question.find(params[:question_id])
    if @answer.save

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "answers" SET "accepted" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["accepted", "t"], ["updated_at", "2015-04-15 15:01:37.791501"], ["id", 4]]
---
  def update
    @answer = Answer.find params[:answer][:answer_id]
    @answer.update_attributes(accepted: true)