app/controllers/comments_controller.rb

  def create
    if request.xhr?
      comment = Comment.create(commentable_type: params[:comment][:commentable_type], commentable_id: params[:comment][:commentable_id], user_id: session[:user_id], content: params[:comment][:content])
---
INSERT INTO "comments" ("commentable_type", "commentable_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["commentable_type", "Answer"], ["commentable_id", 3], ["user_id", 4], ["content", "got that sandwich"], ["created_at", "2015-04-14 22:50:43.173425"], ["updated_at", "2015-04-14 22:50:43.173425"]]