app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC
---
  def index
    @questions = Question.all

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    render_page
    @question = Question.find(params[:id])

INSERT INTO "questions" ("url", "title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @question = current_user.questions.build(question_params)
    if @question.save