app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", ""]]
---
  def create
    @user = User.find_by(username: params[:user][:username]).try(:authenticate, params[:user][:password])